---
kind: type
id: T:Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent
source: html/c612ce53-9774-8d74-28fc-5918c6491576.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent

This class is used by IExternalResourceServers to return KeyBasedTreeEntries data to Revit when their
 LoadResource method is invoked.

## Syntax (C#)
```csharp
public class KeyBasedTreeEntriesLoadContent : ExternalResourceLoadContent
```

## Remarks
The class contains a KeyBasedTreeEntries object which should hold the KeyBasedTreeEntries data generated by the
 IExternalResourceServer. An ExternalResourceServer can create the KeyBasedTreeEntries from an arbitrary data source by using AddEntry
 to add individual KeyBasedTreeEntries. Once all the desired entries have been added, BuildEntries can be called
 to construct the KeyBasedTreeEntries object from the individual entries that were added. KeyBasedTreeEntriesLoadContent must have a built KeyBasedTreeEntries before its LoadStatus property
 can be set to ExternalResourceLoadStatus.Success.